PAVANbharadwj/BITSILICA/STM32/STM own Drivers/stm32l4xx_drivers/Src/ultrasonic.c
/*
 * ultrasonic.c
 *
 *  Created on: Nov 25, 2025
 *      Author: pavan
 */

#include "stm32l476xx.h"
#include "stm32l476xx_gpio_driver.h"

void delay_us(uint32_t us)
{
    volatile uint32_t count;
    while(us--)
    {
        count = 16;
        while(count--) ;
    }
}

void delay_ms(uint32_t ms)
{
    while(ms--) delay_us(1000);
}
uint32_t distance = 0;
int main(void)
{
    GPIO_Handle_t Trig, Echo;

    // Enable clocks
    GPIO_PeriClockControl(GPIOA, 1);

    // TRIG: PA5 output
    Trig.pGPIOx = GPIOA;
    Trig.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_5;
    Trig.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    Trig.GPIO_PinConfig.GPIO_PinSpeed = GPIO_HIGH_SPEED;
    Trig.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
    Trig.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    GPIO_Init(&Trig);

    // ECHO: PA6 input
    Echo.pGPIOx = GPIOA;
    Echo.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
    Echo.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
    Echo.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    GPIO_Init(&Echo);

    uint32_t time_us = 0;


    while(1)
    {
        GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_5, 0);
        delay_us(2);
        GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_5, 1);
        delay_us(10);
        GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_5, 0);

        while(GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_6) == 0);

        time_us = 0;
        while(GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_6) == 1)
        {
            delay_us(1);
            time_us++;
        }

        // 4) Calculate distance (speed of sound = 343 m/s)
        distance = time_us / 58;

        // Put breakpoint here or send via UART
        // printf("Distance: %lu cm\n", distance);

        delay_ms(10);
    }
}

